templates/ws-discovery__probe.xml

<?xml version='1.0' encoding='ASCII'?>
<soap:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
               xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
               xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsa:Action>
        <wsa:MessageID>{{MSG_ID}}</wsa:MessageID>
        <wsa:From>
            <wsa:Address>{{FROM}}</wsa:Address>
        </wsa:From>
        <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:ReplyTo>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:ReplyTo>
    </soap:Header>
    <soap:Body>
        <wsd:Probe>
            {{OPT_TYPES}}
        </wsd:Probe>
    </soap:Body>
</soap:Envelope>

